<!DOCTYPE html><html>
<head>
	<link href="Estilo.css" rel="stylesheet" type="text/css" />
	<title>[A-Life] Investigación sobre Evolución y Vida Artificial</title>
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<meta name="description" content="Investigación sobre Evolución y Vida Artificial"/>
	<meta name="keywords" content="vida artificial, algoritmos genéticos, evolución gramatical"/>
	<meta http-equiv="Content-Type" content="text/html;charset=UTF-8">
</head>
<body>
	<header>
		<h1>A-Life: Investigación sobre Evolución y Vida Artificial</h1>
	</header>
	
	<section>
		<article>
			<table>
				<tr>
					<th>Última actualización</th>
					<th>Sección Actualizada</th>
				</tr>
					<tr>
						<td>25 de agosto de 2024</td>
						<td>Artículos</td>
						<td><a href="https://es.wikipedia.org/wiki/Eslab%C3%B3n_perdido">Eslabón perdido</a></td>
					</tr>
			</table>
		</article>
	</section>

	<article>
		<br>
		<p><a href="Espanol/Colaboracion.htm">Investigación sobre colaboración entre individuos para adaptarse y sobrevivir</a><p>
		<br>
		<p><a href="Espanol/Articu00.htm">Colección de artículos sobre evolución, vida e inteligencia artificial</a></p>
		<br>
		<p><a href="Espanol/Historia.htm">Historia de esta investigación sobre vida artificial</a></p>
		<br>
		<p><a href="Espanol/Historial.htm">Log de actualizaciones de este sitio Web</a></p>
		<br>
		<p><a href="Espanol/Autor.htm">Sobre el Autor: Rafael Alberto Moreno Parra</a></p>
	</article>
	<br>

	<section>
	<article>
	<table>
		<tr><th>Libros escritos por el autor de temas usados para la investigación</th></tr>
		
		<tr>
		<td>
		<p><h3>C# y .NET 8. 2024.</h3></p>
		<p>Lenguaje usado en las simulaciones. Dividido en las siguientes partes:</p>
		<p>Parte 1: IDE, variables, ciclos, si condicional, funciones</p>
		<p>Parte 2: Cadenas (strings)</p>
		<p>Parte 3: Arreglos estáticos</p>
		<p>Parte 4: Programación Orientada a Objetos</p>
		<p>Parte 5: Estructuras de datos dinámicas</p>
		<p>Parte 6: LINQ</p>
		<p>Parte 7: Un evaluador de expresiones algebraicas</p>
		<p>Parte 8: Estructuras de datos de bajo nivel</p>
		<p>Parte 9: Simulaciones</p>
		<p>Parte 10: Algoritmos evolutivos</p>
		<p>Parte 11: Redes Neuronales</p>
		<p>Parte 12: Gráficos 2D</p>
		<p>Parte 13: Gráficos en 3D</p>
		<p>Parte 14: Animación</p>
		
		<p><a href="https://github.com/ramsoftware/C-Sharp">Desc&aacute;rguelo (documento en PDF y código fuente)</a></p>
		</td>
		</tr>
		

		<tr>
		<td>
		<p><h3>Capacitándose en JavaScript. 2024.</h3></p>
		<p>Lenguaje usado en este sitio Web para hacer demostraciones de simulaciones.</p>
		<p><a href="https://github.com/ramsoftware/JavaScript">Desc&aacute;rguelo (documento en PDF y código fuente)</a></p>
		</td>
		</tr>
		
		<tr>
		<td>
		<p><h3>Redes Neuronales. Segunda edición. 2020.</h3></p>
		<p>Este libro es un inicio en este fascinante campo de las redes neuronales, desde el &ldquo;hola mundo&rdquo; que es entrenar una red (de una sola neurona) para que aprenda la tabla del OR y del AND, luego el perceptr&oacute;n multicapa (capas de neuronas interconectadas) para aprender cosas m&aacute;s dif&iacute;ciles como la tabla del XOR, reconocimiento b&aacute;sico de caracteres y encontrar el patr&oacute;n en una serie de datos usando el algoritmo &ldquo;backpropagation&rdquo;. Se explica en detalle c&oacute;mo se llegan a las f&oacute;rmulas usadas por ese algoritmo.</p>
		<p><a href="https://github.com/ramsoftware/LibroRedNeuronal2020">Desc&aacute;rguelo</a></p>
		</td>
		</tr>

		<tr>
		<td><p><h3>Evaluador de Expresiones Algebraicas</h3></p>
		<p>&iquest;Qu&eacute; es un evaluador de expresiones? Tenemos la expresi&oacute;n &ldquo;K/(3.78 + cos(X/7.96+Y*1.554)-tan(3.7/X)+B)&rdquo; almacenada en una variable de tipo Cadena (String). Necesitamos que un algoritmo resuelva esa expresi&oacute;n y retorne el valor cuantitativo una vez que las variables K, X, Y y B se les asignen un valor real.</p>
		<p><a href="https://github.com/ramsoftware/Evaluador3">Descargue Libro Versi&oacute;n 3</a> (C#, C++, Delphi, Java, JavaScript, PHP, Python, TypeScript, Visual Basic .NET)</p>		
		</td>
		</tr>

		<tr>
		<td><p><h3>Un uso de algoritmos gen&eacute;ticos para b&uacute;squeda de patrones</h3></p>
		<p>ISBN: 978-958-762-479-3</p>
		<p>La detecci&oacute;n de patrones de comportamiento en una serie de datos dada sirve para poder hacer: interpolaci&oacute;n, el cual nos permite encontrar los valores intermedios entre dos puntos y usar esto para completar (por ejemplo para el trazado de una curva que una esos puntos); la extrapolaci&oacute;n para poder predecir el comportamiento futuro de los datos (por supuesto, con reservas); para encontrar una curva menos costosa en c&aacute;lculo con respecto a otra, y para compresi&oacute;n de datos, porque en vez de guardar una larga lista de datos, es mucho m&aacute;s corto guardar la expresi&oacute;n algebraica que genera esos datos.</p>
		<p>Regresi&oacute;n Simb&oacute;lica Y=F(X). <a href="./Download/Version9src.zip">C&oacute;digo fuente</a> y <a href="./Download/Version9exe.zip">Ejecutable</a></p>
		<p>Regresi&oacute;n Simb&oacute;lica Z=F(X,Y). <a href="./Download/Version9XYsrc.zip">C&oacute;digo fuente</a> y <a href="./Download/Version9XYexe.zip">Ejecutable</a></p>
		</td>
		</tr>
		<tr>
		<td>
		<p><h3>Segunda parte de uso de algoritmos gen&eacute;ticos para la b&uacute;squeda de patrones</h3></p>
		<p>ISBN:  ISBN: 978-958-762-483-0</p>
		<p>En esta segunda parte, el libro aborda como se resolvi&oacute; el problema de manejar una gran cantidad de diversas funciones y operaciones matem&aacute;ticas sin perder la eficiencia. Una vez resuelto ese punto, el paso siguiente es probar si es cierto que el algoritmo gen&eacute;tico al tener acceso a todas esas nuevas funciones matem&aacute;ticas logra mejores curvas de aproximaci&oacute;n.</p>
		</td>
		</tr>
	</table>
	<br>
	</article>
	</section>
</body>
</html>
